bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_romdriver.h
    ROM_API_INDEX_SFlash_Init,
    ROM_API_INDEX_SFlash_SetSPIMode,
    ROM_API_INDEX_SFlash_Read_Reg,
    ROM_API_INDEX_SFlash_Write_Reg,
    ROM_API_INDEX_SFlash_Read_Reg_With_Cmd,
    ROM_API_INDEX_SFlash_Write_Reg_With_Cmd,
    ROM_API_INDEX_SFlash_Clear_Status_Register,
    ROM_API_INDEX_SFlash_Busy,
    ROM_API_INDEX_SFlash_Write_Enable,
    ROM_API_INDEX_SFlash_Qspi_Enable,
    ROM_API_INDEX_SFlash_Volatile_Reg_Write_Enable,
    ROM_API_INDEX_SFlash_Chip_Erase,
    ROM_API_INDEX_SFlash_Sector_Erase,
    ROM_API_INDEX_SFlash_Blk32_Erase,
    ROM_API_INDEX_SFlash_Blk64_Erase,
    ROM_API_INDEX_SFlash_Erase,
    ROM_API_INDEX_SFlash_Program,
    ROM_API_INDEX_SFlash_GetUniqueId,
    ROM_API_INDEX_SFlash_GetJedecId,
    ROM_API_INDEX_SFlash_GetDeviceId,
    ROM_API_INDEX_SFlash_Powerdown,
    ROM_API_INDEX_SFlash_Releae_Powerdown,
    ROM_API_INDEX_SFlash_Restore_From_Powerdown,
    ROM_API_INDEX_SFlash_SetBurstWrap,
    ROM_API_INDEX_SFlash_DisableBurstWrap,
    ROM_API_INDEX_SFlash_Software_Reset,
    ROM_API_INDEX_SFlash_Reset_Continue_Read,
    ROM_API_INDEX_SFlash_Set_IDbus_Cfg,
    ROM_API_INDEX_SFlash_IDbus_Read_Enable,
    ROM_API_INDEX_SFlash_Cache_Read_Enable,
    ROM_API_INDEX_SFlash_Cache_Read_Disable,
    ROM_API_INDEX_SFlash_Read,

    ROM_API_INDEX_UART_SetBaudRate,
    ROM_API_INDEX_UART_Init,
    ROM_API_INDEX_UART_DeInit,
    ROM_API_INDEX_UART_FifoConfig,
    ROM_API_INDEX_UART_Enable,
    ROM_API_INDEX_UART_Disable,
    ROM_API_INDEX_UART_SetTxDataLength,
    ROM_API_INDEX_UART_SetRxDataLength,
    ROM_API_INDEX_UART_SetRxTimeoutValue,
    ROM_API_INDEX_UART_SetRxByteCount,
    ROM_API_INDEX_UART_SetDeglitchCount,
    ROM_API_INDEX_UART_ApplyAbrResult,
    ROM_API_INDEX_UART_SetRtsValue,
    ROM_API_INDEX_UART_ClrRtsValue,
    ROM_API_INDEX_UART_SetTxValue,
    ROM_API_INDEX_UART_ClrTxValue,
    ROM_API_INDEX_UART_TxFreeRun,
    ROM_API_INDEX_UART_AutoBaudDetection,
    ROM_API_INDEX_UART_SetAllowableError0X55,
    ROM_API_INDEX_UART_GetBitWidth0X55,
    ROM_API_INDEX_UART_SetRS485,
    ROM_API_INDEX_UART_TxFifoClear,
    ROM_API_INDEX_UART_RxFifoClear,
    ROM_API_INDEX_UART_IntMask,
    ROM_API_INDEX_UART_IntClear,
    ROM_API_INDEX_UART_SendData,
    ROM_API_INDEX_UART_SendDataBlock,
    ROM_API_INDEX_UART_ReceiveData,
    ROM_API_INDEX_UART_GetAutoBaudCount,
    ROM_API_INDEX_UART_GetRxByteCount,
    ROM_API_INDEX_UART_GetTxFifoCount,
    ROM_API_INDEX_UART_GetRxFifoCount,
    ROM_API_INDEX_UART_GetIntStatus,
    ROM_API_INDEX_UART_GetTxBusBusyStatus,
    ROM_API_INDEX_UART_GetRxBusBusyStatus,
    ROM_API_INDEX_UART_GetOverflowStatus,

    ROM_API_INDEX_XIP_SFlash_Opt_Enter,
    ROM_API_INDEX_XIP_SFlash_Opt_Exit,
    ROM_API_INDEX_XIP_SFlash_State_Save,
    ROM_API_INDEX_XIP_SFlash_State_Restore,
    ROM_API_INDEX_XIP_SFlash_Erase_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_Write_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_Read_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_GetJedecId_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_GetDeviceId_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_GetUniqueId_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_Read_Via_Cache_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_Clear_Status_Register_Need_Lock,

    ROM_API_INDEX_IR_TxInit,
    ROM_API_INDEX_IR_TxPulseWidthConfig,
    ROM_API_INDEX_IR_FifoConfig,
    ROM_API_INDEX_IR_DeInit,
    ROM_API_INDEX_IR_Enable,
    ROM_API_INDEX_IR_Disable,
    ROM_API_INDEX_IR_TxSWM,
    ROM_API_INDEX_IR_TxFifoClear,
    ROM_API_INDEX_IR_SendData,
    ROM_API_INDEX_IR_SWMSendData,
    ROM_API_INDEX_IR_SendCommand,
    ROM_API_INDEX_IR_SWMSendCommand,
    ROM_API_INDEX_IR_SendNEC,
    ROM_API_INDEX_IR_IntMask,
    ROM_API_INDEX_IR_ClrIntStatus,
    ROM_API_INDEX_IR_GetIntStatus,
    ROM_API_INDEX_IR_GetFifoStatus,
    ROM_API_INDEX_IR_GetTxFifoCount,
    ROM_API_INDEX_IR_LEDInit,
    ROM_API_INDEX_IR_LEDSend,

    ROM_API_INDEX_KYS_Init,
    ROM_API_INDEX_KYS_Enable,
    ROM_API_INDEX_KYS_Disable,
    ROM_API_INDEX_KYS_IntMask,
    ROM_API_INDEX_KYS_IntClear,
    ROM_API_INDEX_KYS_GetIntStatus,
    ROM_API_INDEX_KYS_Get_FIFO_Idx,
    ROM_API_INDEX_KYS_ReadKeyfifo,

    ROM_API_INDEX_Psram_Init,
    ROM_API_INDEX_Psram_ReadReg,
    ROM_API_INDEX_Psram_WriteReg,
    ROM_API_INDEX_Psram_SetDriveStrength,
    ROM_API_INDEX_Psram_SetBurstWrap,
    ROM_API_INDEX_Psram_ReadId,
    ROM_API_INDEX_Psram_EnterQuadMode,
    ROM_API_INDEX_Psram_ExitQuadMode,
    ROM_API_INDEX_Psram_ToggleBurstLength,
    ROM_API_INDEX_Psram_SoftwareReset,
    ROM_API_INDEX_Psram_Set_IDbus_Cfg,
    ROM_API_INDEX_Psram_Cache_Write_Set,
    ROM_API_INDEX_Psram_Write,
    ROM_API_INDEX_Psram_Read,

    ROM_API_INDEX_TIMER_GetCompValue,
    ROM_API_INDEX_TIMER_SetCompValue,
    ROM_API_INDEX_TIMER_CompValueEffectImmediately,
    ROM_API_INDEX_TIMER_GetCounterValue,
    ROM_API_INDEX_TIMER_ResetCounterValue,
    ROM_API_INDEX_TIMER_GetMatchStatus,
    ROM_API_INDEX_TIMER_GetPreloadValue,
    ROM_API_INDEX_TIMER_SetPreloadValue,
    ROM_API_INDEX_TIMER_SetPreloadTrigSrc,
    ROM_API_INDEX_TIMER_SetCountMode,
    ROM_API_INDEX_TIMER_ClearIntStatus,
    ROM_API_INDEX_TIMER_Init,
    ROM_API_INDEX_TIMER_DeInit,
    ROM_API_INDEX_TIMER_Enable,
    ROM_API_INDEX_TIMER_Disable,
    ROM_API_INDEX_TIMER_IntMask,
    ROM_API_INDEX_TIMER_GPIOSetPolarity,
    ROM_API_INDEX_TIMER_CH0_SetMeasurePulseWidth,
    ROM_API_INDEX_TIMER_CH0_GetMeasurePulseWidth,
    ROM_API_INDEX_TIMER_ForceClockDivision,

    ROM_API_INDEX_WDT_Set_Clock,
    ROM_API_INDEX_WDT_GetMatchValue,
    ROM_API_INDEX_WDT_SetCompValue,
    ROM_API_INDEX_WDT_CompValueEffectImmediately,
    ROM_API_INDEX_WDT_GetCounterValue,
    ROM_API_INDEX_WDT_ResetCounterValue,
    ROM_API_INDEX_WDT_GetResetStatus,
    ROM_API_INDEX_WDT_ClearResetStatus,
    ROM_API_INDEX_WDT_Enable,
    ROM_API_INDEX_WDT_Disable,
    ROM_API_INDEX_WDT_ForceClockDivision,
    ROM_API_INDEX_WDT_IntMask,
    ROM_API_INDEX_WDT_GPIOSetPolarity,

    ROM_API_INDEX_arch_memcpy,
    ROM_API_INDEX_arch_memcpy4,
    ROM_API_INDEX_arch_memcpy_fast,
    ROM_API_INDEX_arch_memset,
    ROM_API_INDEX_arch_memset4,
    ROM_API_INDEX_arch_memcmp,

    ROM_API_INDEX_memcopy_to_fifo,

    ROM_API_INDEX_fifocopy_to_mem,

    ROM_API_INDEX_BFLB_Soft_CRC32_Ex,
    ROM_API_INDEX_BFLB_Soft_CRC32,

    ROM_API_INDEX_FUNC_EMPTY_START,

    ROM_API_INDEX_FUNC_EMPTY_END = ROMAPI_INDEX_MAX

