bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_romdriver.h
} ROM_API_INDEX_e;

/*@} end of group ROMDRIVER_Public_Types */

/** @defgroup  ROMDRIVER_Public_Constants
 *  @{
 */

/*@} end of group ROMDRIVER_Public_Constants */

/** @defgroup  ROMDRIVER_Public_Macros
 *  @{
 */


#define ROM_APITABLE            ((uint32_t *)0x21010800)


#define RomDriver_AON_Power_On_MBG                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_MBG])

#define RomDriver_AON_Power_Off_MBG                       \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_MBG])

#define RomDriver_AON_Power_On_XTAL                       \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_XTAL])

#define RomDriver_AON_Set_Xtal_CapCode                    \
    ((BL_Err_Type (*) (uint8_t capIn, uint8_t capOut))ROM_APITABLE[ROM_API_INDEX_AON_Set_Xtal_CapCode])

#define RomDriver_AON_Get_Xtal_CapCode                    \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Get_Xtal_CapCode])

#define RomDriver_AON_Set_Xtal_CapCode_Extra              \
    ((BL_Err_Type (*) (uint8_t extra))ROM_APITABLE[ROM_API_INDEX_AON_Set_Xtal_CapCode_Extra])

#define RomDriver_AON_Power_Off_XTAL                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_XTAL])

#define RomDriver_AON_Power_On_BG                         \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_BG])

#define RomDriver_AON_Power_Off_BG                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_BG])

#define RomDriver_AON_Power_On_LDO11_SOC                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_LDO11_SOC])

#define RomDriver_AON_Power_Off_LDO11_SOC                 \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_LDO11_SOC])

#define RomDriver_AON_Power_On_SFReg                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_SFReg])

#define RomDriver_AON_Power_Off_SFReg                     \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_SFReg])

#define RomDriver_AON_Set_LDO11_SOC_Sstart_Delay          \
    ((BL_Err_Type (*) (uint8_t delay))ROM_APITABLE[ROM_API_INDEX_AON_Set_LDO11_SOC_Sstart_Delay])

#define RomDriver_AON_Set_DCDC14_Top_0                    \
    ((BL_Err_Type (*) (uint8_t voutSel, uint8_t vpfm))ROM_APITABLE[ROM_API_INDEX_AON_Set_DCDC14_Top_0])

#define RomDriver_AON_Trim_Ldo11socVoutTrim               \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Trim_Ldo11socVoutTrim])

#define RomDriver_AON_Trim_Ldo14VoutTrim                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Trim_Ldo14VoutTrim])

#define RomDriver_AON_Trim_Dcdc14VoutTrim                 \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Trim_Dcdc14VoutTrim])

#define RomDriver_Clock_System_Clock_Get                  \
    ((uint32_t (*) (BL_System_Clock_Type type))ROM_APITABLE[ROM_API_INDEX_Clock_System_Clock_Get])

#define RomDriver_Clock_Peripheral_Clock_Get              \
    ((uint32_t (*) (BL_Peripheral_Type type))ROM_APITABLE[ROM_API_INDEX_Clock_Peripheral_Clock_Get])

#define RomDriver_SystemCoreClockGet                      \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_SystemCoreClockGet])

#define RomDriver_CPU_Get_MTimer_Clock                    \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_CPU_Get_MTimer_Clock])

#define RomDriver_CPU_Get_MTimer_Counter                  \
    ((uint64_t (*) (void))ROM_APITABLE[ROM_API_INDEX_CPU_Get_MTimer_Counter])

#define RomDriver_CPU_Get_CPU_Cycle                       \
    ((uint64_t (*) (void))ROM_APITABLE[ROM_API_INDEX_CPU_Get_CPU_Cycle])

#define RomDriver_CPU_Get_MTimer_US                       \
    ((uint64_t (*) (void))ROM_APITABLE[ROM_API_INDEX_CPU_Get_MTimer_US])

#define RomDriver_CPU_Get_MTimer_MS                       \
    ((uint64_t (*) (void))ROM_APITABLE[ROM_API_INDEX_CPU_Get_MTimer_MS])

#define RomDriver_CPU_MTimer_Delay_US                     \
    ((BL_Err_Type (*) (uint32_t cnt))ROM_APITABLE[ROM_API_INDEX_CPU_MTimer_Delay_US])

#define RomDriver_CPU_MTimer_Delay_MS                     \
    ((BL_Err_Type (*) (uint32_t cnt))ROM_APITABLE[ROM_API_INDEX_CPU_MTimer_Delay_MS])

#define RomDriver_BL702L_Delay_US                         \
    ((void (*) (uint32_t cnt))ROM_APITABLE[ROM_API_INDEX_BL702L_Delay_US])

#define RomDriver_BL702L_Delay_MS                         \
    ((void (*) (uint32_t cnt))ROM_APITABLE[ROM_API_INDEX_BL702L_Delay_MS])

#define RomDriver_EF_Ctrl_Get_Trim_Parity                 \
    ((uint8_t (*) (uint32_t val, uint8_t len))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Get_Trim_Parity])

#define RomDriver_EF_Ctrl_Read_Common_Trim                \
    ((void (*) (char *name, Efuse_Common_Trim_Type *trim))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_Common_Trim])

#define RomDriver_EF_Ctrl_Write_Common_Trim               \
    ((void (*) (char *name, uint8_t trim_en, uint32_t trim_value))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Write_Common_Trim])

#define RomDriver_EF_Ctrl_Is_MAC_Address_Slot_Empty       \
    ((uint8_t (*) (uint8_t slot, uint8_t reload))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Is_MAC_Address_Slot_Empty])

#define RomDriver_EF_Ctrl_Write_MAC_Address_Opt           \
    ((BL_Err_Type (*) (uint8_t slot, uint8_t mac[8], uint8_t program))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Write_MAC_Address_Opt])

#define RomDriver_EF_Ctrl_Read_MAC_Address_Opt            \
    ((BL_Err_Type (*) (uint8_t slot, uint8_t mac[8], uint8_t reload))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_MAC_Address_Opt])

#define RomDriver_EF_Ctrl_Sw_AHB_Clk_0                    \
    ((void (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Sw_AHB_Clk_0])

#define RomDriver_EF_Ctrl_Program_Efuse_0                 \
    ((void (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Program_Efuse_0])

#define RomDriver_EF_Ctrl_Load_Efuse_R0                   \
    ((void (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Load_Efuse_R0])

#define RomDriver_EF_Ctrl_Busy                            \
    ((BL_Sts_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Busy])

