bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_romdriver.h
#define RomDriver_GLB_Set_System_CLK_Div                  \
    ((BL_Err_Type (*) (uint8_t hclkDiv, uint8_t bclkDiv))ROM_APITABLE[ROM_API_INDEX_GLB_Set_System_CLK_Div])

#define RomDriver_GLB_Get_BCLK_Div                        \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_BCLK_Div])

#define RomDriver_GLB_Get_HCLK_Div                        \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_HCLK_Div])

#define RomDriver_GLB_Set_System_CLK                      \
    ((BL_Err_Type (*) (GLB_DLL_XTAL_Type xtalType, GLB_SYS_CLK_Type clkFreq))ROM_APITABLE[ROM_API_INDEX_GLB_Set_System_CLK])

#define RomDriver_System_Core_Clock_Update_From_RC32M     \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_System_Core_Clock_Update_From_RC32M])

#define RomDriver_GLB_Set_MAC154_ZIGBEE_CLK               \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_Set_MAC154_ZIGBEE_CLK])

#define RomDriver_GLB_Set_BLE_CLK                         \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_Set_BLE_CLK])

#define RomDriver_GLB_Set_AUDIO_CLK                       \
    ((BL_Err_Type (*) (uint8_t clkDivEn, uint8_t autoDivEn, GLB_AUDIO_CLK_SRC_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_AUDIO_CLK])

#define RomDriver_GLB_Set_KYS_CLK                         \
    ((BL_Err_Type (*) (GLB_KYS_CLK_SRC_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_KYS_CLK])

#define RomDriver_GLB_Set_DMA_CLK                         \
    ((BL_Err_Type (*) (uint8_t enable, GLB_DMA_CLK_ID_Type clk))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DMA_CLK])

#define RomDriver_GLB_Set_IR_CLK                          \
    ((BL_Err_Type (*) (uint8_t enable, GLB_IR_CLK_SRC_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_IR_CLK])

#define RomDriver_GLB_Set_SF_CLK                          \
    ((BL_Err_Type (*) (uint8_t enable, GLB_SFLASH_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_SF_CLK])

#define RomDriver_GLB_Set_UART_CLK                        \
    ((BL_Err_Type (*) (uint8_t enable, HBN_UART_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_UART_CLK])

#define RomDriver_GLB_Sel_TMR_GPIO_Clock                  \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_Sel_TMR_GPIO_Clock])

#define RomDriver_GLB_Set_Chip_Out_0_CLK_Sel              \
    ((BL_Err_Type (*) (GLB_CHIP_CLK_OUT_0_Type clkSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Chip_Out_0_CLK_Sel])

#define RomDriver_GLB_Set_Chip_Out_1_CLK_Sel              \
    ((BL_Err_Type (*) (GLB_CHIP_CLK_OUT_1_Type clkSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Chip_Out_1_CLK_Sel])

#define RomDriver_GLB_Set_Chip_Out_0_CLK_Enable           \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Chip_Out_0_CLK_Enable])

#define RomDriver_GLB_Set_Chip_Out_1_CLK_Enable           \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Chip_Out_1_CLK_Enable])

#define RomDriver_GLB_Set_I2C_CLK                         \
    ((BL_Err_Type (*) (uint8_t enable, GLB_I2C_CLK_SRC_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_I2C_CLK])

#define RomDriver_GLB_Set_SPI_CLK                         \
    ((BL_Err_Type (*) (uint8_t enable, GLB_SPI_CLK_SRC_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_SPI_CLK])

#define RomDriver_GLB_Set_PKA_CLK_Sel                     \
    ((BL_Err_Type (*) (GLB_PKA_CLK_SRC_Type clkSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_PKA_CLK_Sel])

#define RomDriver_GLB_SW_System_Reset                     \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_SW_System_Reset])

#define RomDriver_GLB_SW_CPU_Reset                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_SW_CPU_Reset])

#define RomDriver_GLB_SW_POR_Reset                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_SW_POR_Reset])

#define RomDriver_GLB_AHB_MCU_Software_Reset              \
    ((BL_Err_Type (*) (GLB_AHB_MCU_SW_Type swrst))ROM_APITABLE[ROM_API_INDEX_GLB_AHB_MCU_Software_Reset])

#define RomDriver_GLB_Disrst_Set                          \
    ((BL_Err_Type (*) (uint8_t enable, GLB_DISRST_Type disrst))ROM_APITABLE[ROM_API_INDEX_GLB_Disrst_Set])

#define RomDriver_GLB_MAC154_ZIGBEE_Reset                 \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_MAC154_ZIGBEE_Reset])

#define RomDriver_GLB_BLE_Reset                           \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_BLE_Reset])

#define RomDriver_GLB_PER_Clock_Gate                      \
    ((BL_Err_Type (*) (uint64_t ips))ROM_APITABLE[ROM_API_INDEX_GLB_PER_Clock_Gate])

#define RomDriver_GLB_PER_Clock_UnGate                    \
    ((BL_Err_Type (*) (uint64_t ips))ROM_APITABLE[ROM_API_INDEX_GLB_PER_Clock_UnGate])

#define RomDriver_GLB_Set_RTC_Mode                        \
    ((BL_Err_Type (*) (RTC_MODE_Type rtcMode))ROM_APITABLE[ROM_API_INDEX_GLB_Set_RTC_Mode])

#define RomDriver_GLB_BMX_Init                            \
    ((BL_Err_Type (*) (BMX_Cfg_Type *BmxCfg))ROM_APITABLE[ROM_API_INDEX_GLB_BMX_Init])

#define RomDriver_GLB_BMX_Addr_Monitor_Enable             \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_BMX_Addr_Monitor_Enable])

#define RomDriver_GLB_BMX_Addr_Monitor_Disable            \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_BMX_Addr_Monitor_Disable])

#define RomDriver_GLB_BMX_BusErrResponse_Enable           \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_BMX_BusErrResponse_Enable])

#define RomDriver_GLB_BMX_BusErrResponse_Disable          \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_BMX_BusErrResponse_Disable])

#define RomDriver_GLB_BMX_Get_Status                      \
    ((BL_Sts_Type (*) (BMX_BUS_ERR_Type errType))ROM_APITABLE[ROM_API_INDEX_GLB_BMX_Get_Status])

#define RomDriver_GLB_BMX_Get_Err_Addr                    \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_BMX_Get_Err_Addr])

#define RomDriver_GLB_BMX_BusErrClr_Set                   \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_BMX_BusErrClr_Set])

#define RomDriver_GLB_Set_SRAM_PARM                       \
    ((BL_Err_Type (*) (uint32_t value))ROM_APITABLE[ROM_API_INDEX_GLB_Set_SRAM_PARM])

#define RomDriver_GLB_Get_SRAM_PARM                       \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_SRAM_PARM])

#define RomDriver_GLB_Set_OCRAM_PARM                      \
    ((BL_Err_Type (*) (uint32_t value))ROM_APITABLE[ROM_API_INDEX_GLB_Set_OCRAM_PARM])

#define RomDriver_GLB_Get_OCRAM_PARM                      \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_OCRAM_PARM])

#define RomDriver_GLB_Set_EM_Sel                          \
    ((BL_Err_Type (*) (GLB_EM_Type emType))ROM_APITABLE[ROM_API_INDEX_GLB_Set_EM_Sel])

#define RomDriver_GLB_Set_Kys_Drv_Col                     \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Kys_Drv_Col])

