bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_romdriver.h
#define RomDriver_GLB_GPIO_O_Latch_Mode_Set               \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_O_Latch_Mode_Set])

#define RomDriver_GLB_JTAG_Sig_Swap_Set                   \
    ((BL_Err_Type (*) (uint8_t swapSel))ROM_APITABLE[ROM_API_INDEX_GLB_JTAG_Sig_Swap_Set])

#define RomDriver_GLB_CCI_Use_IO_0_1_2_7                  \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_CCI_Use_IO_0_1_2_7])

#define RomDriver_GLB_CCI_Use_Jtag_Pin                    \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_CCI_Use_Jtag_Pin])

#define RomDriver_GLB_Swap_SPI_0_MOSI_With_MISO           \
    ((BL_Err_Type (*) (BL_Fun_Type newState))ROM_APITABLE[ROM_API_INDEX_GLB_Swap_SPI_0_MOSI_With_MISO])

#define RomDriver_GLB_Set_SPI_0_ACT_MOD_Sel               \
    ((BL_Err_Type (*) (GLB_SPI_PAD_ACT_AS_Type mod))ROM_APITABLE[ROM_API_INDEX_GLB_Set_SPI_0_ACT_MOD_Sel])

#define RomDriver_GLB_Set_Flash_Scenario                  \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Flash_Scenario])

#define RomDriver_GLB_Set_Embedded_FLash_IO_PARM          \
    ((BL_Err_Type (*) (uint8_t reverse, uint8_t swapIo3Io0, uint8_t swapIo2Cs))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Embedded_FLash_IO_PARM])

#define RomDriver_GLB_Set_MTimer_CLK                      \
    ((BL_Err_Type (*) (uint8_t enable, GLB_MTIMER_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_MTimer_CLK])

#define RomDriver_GLB_Set_ADC_CLK                         \
    ((BL_Err_Type (*) (uint8_t enable, GLB_ADC_CLK_SRC_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_ADC_CLK])

#define RomDriver_GLB_Set_DIG_32K_CLK                     \
    ((BL_Err_Type (*) (uint8_t enable, uint8_t compensation, GLB_DIG_CLK_SRC_Type clkSel, uint16_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DIG_32K_CLK])

#define RomDriver_GLB_SW_BLE_WAKEUP_REQ_Set               \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_SW_BLE_WAKEUP_REQ_Set])

#define RomDriver_GLB_UART_Fun_Sel                        \
    ((BL_Err_Type (*) (GLB_UART_SIG_Type sig, GLB_UART_SIG_FUN_Type fun))ROM_APITABLE[ROM_API_INDEX_GLB_UART_Fun_Sel])

#define RomDriver_GLB_Power_Off_DLL                       \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Power_Off_DLL])

#define RomDriver_GLB_Power_On_DLL                        \
    ((BL_Err_Type (*) (GLB_DLL_XTAL_Type xtalType))ROM_APITABLE[ROM_API_INDEX_GLB_Power_On_DLL])

#define RomDriver_GLB_Enable_DLL_All_Clks                 \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Enable_DLL_All_Clks])

#define RomDriver_GLB_Enable_DLL_Clk                      \
    ((BL_Err_Type (*) (GLB_DLL_CLK_Type dllClk))ROM_APITABLE[ROM_API_INDEX_GLB_Enable_DLL_Clk])

#define RomDriver_GLB_Disable_DLL_All_Clks                \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Disable_DLL_All_Clks])

#define RomDriver_GLB_Disable_DLL_Clk                     \
    ((BL_Err_Type (*) (GLB_DLL_CLK_Type dllClk))ROM_APITABLE[ROM_API_INDEX_GLB_Disable_DLL_Clk])

#define RomDriver_GLB_Set_Flash_Id_Value                  \
    ((BL_Err_Type (*) (uint32_t idValue))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Flash_Id_Value])

#define RomDriver_GLB_Get_Flash_Id_Value                  \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_Flash_Id_Value])

#define RomDriver_GLB_Trim_RC32M                          \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Trim_RC32M])

#define RomDriver_GLB_Set_Xtal_Cnt32k_Process             \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Xtal_Cnt32k_Process])

#define RomDriver_GLB_Clear_Xtal_Cnt32k_Done              \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Clear_Xtal_Cnt32k_Done])

#define RomDriver_GLB_RC32K_Deg_Start                     \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_RC32K_Deg_Start])

#define RomDriver_GLB_RC32K_Deg_End                       \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_RC32K_Deg_End])

#define RomDriver_GLB_RC32K_Deg_Enable                    \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_RC32K_Deg_Enable])

#define RomDriver_GLB_Xtal_Deg_Cnt_Limit_Set              \
    ((BL_Err_Type (*) (uint8_t cnt))ROM_APITABLE[ROM_API_INDEX_GLB_Xtal_Deg_Cnt_Limit_Set])

#define RomDriver_GLB_IR_LED_Driver_Enable                \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_IR_LED_Driver_Enable])

#define RomDriver_GLB_IR_LED_Driver_Disable               \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_IR_LED_Driver_Disable])

#define RomDriver_GLB_IR_LED_Driver_Output_Enable         \
    ((BL_Err_Type (*) (GLB_IR_LED_Type led))ROM_APITABLE[ROM_API_INDEX_GLB_IR_LED_Driver_Output_Enable])

#define RomDriver_GLB_IR_LED_Driver_Output_Disable        \
    ((BL_Err_Type (*) (GLB_IR_LED_Type led))ROM_APITABLE[ROM_API_INDEX_GLB_IR_LED_Driver_Output_Disable])

#define RomDriver_GLB_IR_LED_Driver_Ibias                 \
    ((BL_Err_Type (*) (uint8_t ibias))ROM_APITABLE[ROM_API_INDEX_GLB_IR_LED_Driver_Ibias])

#define RomDriver_GLB_GPIO_Init                           \
    ((BL_Err_Type (*) (GLB_GPIO_Cfg_Type *cfg))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Init])

#define RomDriver_GLB_GPIO_Func_Init                      \
    ((BL_Err_Type (*) (GLB_GPIO_FUNC_Type gpioFun, GLB_GPIO_Type *pinList, uint8_t cnt))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Func_Init])

#define RomDriver_GLB_GPIO_OUTPUT_Mode_Set                \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin, GLB_GPIO_OUTPUT_MODE_Type mode))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_OUTPUT_Mode_Set])

#define RomDriver_GLB_GPIO_INPUT_Enable                   \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_INPUT_Enable])

#define RomDriver_GLB_GPIO_INPUT_Disable                  \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_INPUT_Disable])

