bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_romdriver.h
#define RomDriver_HBN_Get_User_Boot_Config                \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_User_Boot_Config])

#define RomDriver_HBN_Set_User_Boot_Config                \
    ((BL_Err_Type (*) (uint8_t ubCfg))ROM_APITABLE[ROM_API_INDEX_HBN_Set_User_Boot_Config])

#define RomDriver_HBN_Clear_RTC_Counter                   \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Clear_RTC_Counter])

#define RomDriver_HBN_Enable_RTC_Counter                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Enable_RTC_Counter])

#define RomDriver_HBN_Set_RTC_Timer                       \
    ((BL_Err_Type (*) (HBN_RTC_INT_Delay_Type delay, uint32_t compValLow, uint32_t compValHigh, uint8_t compMode))ROM_APITABLE[ROM_API_INDEX_HBN_Set_RTC_Timer])

#define RomDriver_HBN_Get_RTC_Timer_Val                   \
    ((BL_Err_Type (*) (uint32_t *valLow, uint32_t *valHigh))ROM_APITABLE[ROM_API_INDEX_HBN_Get_RTC_Timer_Val])

#define RomDriver_HBN_Clear_RTC_INT                       \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Clear_RTC_INT])

#define RomDriver_HBN_GPIO_INT_Enable                     \
    ((BL_Err_Type (*) (HBN_GPIO_INT_Trigger_Type gpioIntTrigType))ROM_APITABLE[ROM_API_INDEX_HBN_GPIO_INT_Enable])

#define RomDriver_HBN_GPIO_INT_Disable                    \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_GPIO_INT_Disable])

#define RomDriver_HBN_Get_INT_State                       \
    ((BL_Sts_Type (*) (HBN_INT_Type irqType))ROM_APITABLE[ROM_API_INDEX_HBN_Get_INT_State])

#define RomDriver_HBN_Get_Pin_Wakeup_Mode                 \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_Pin_Wakeup_Mode])

#define RomDriver_HBN_Clear_IRQ                           \
    ((BL_Err_Type (*) (HBN_INT_Type irqType))ROM_APITABLE[ROM_API_INDEX_HBN_Clear_IRQ])

#define RomDriver_HBN_Hw_Pu_Pd_Cfg                        \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_HBN_Hw_Pu_Pd_Cfg])

#define RomDriver_HBN_Comm_Pad_Wakeup_En_Cfg              \
    ((BL_Err_Type (*) (uint8_t padCfg))ROM_APITABLE[ROM_API_INDEX_HBN_Comm_Pad_Wakeup_En_Cfg])

#define RomDriver_HBN_Aon_Pad_IeSmt_Cfg                   \
    ((BL_Err_Type (*) (uint8_t padCfg))ROM_APITABLE[ROM_API_INDEX_HBN_Aon_Pad_IeSmt_Cfg])

#define RomDriver_HBN_Pin_WakeUp_Mask                     \
    ((BL_Err_Type (*) (uint16_t maskVal))ROM_APITABLE[ROM_API_INDEX_HBN_Pin_WakeUp_Mask])

#define RomDriver_HBN_Enable_AComp0_IRQ                   \
    ((BL_Err_Type (*) (HBN_ACOMP_INT_EDGE_Type edge))ROM_APITABLE[ROM_API_INDEX_HBN_Enable_AComp0_IRQ])

#define RomDriver_HBN_Disable_AComp0_IRQ                  \
    ((BL_Err_Type (*) (HBN_ACOMP_INT_EDGE_Type edge))ROM_APITABLE[ROM_API_INDEX_HBN_Disable_AComp0_IRQ])

#define RomDriver_HBN_Enable_AComp1_IRQ                   \
    ((BL_Err_Type (*) (HBN_ACOMP_INT_EDGE_Type edge))ROM_APITABLE[ROM_API_INDEX_HBN_Enable_AComp1_IRQ])

#define RomDriver_HBN_Disable_AComp1_IRQ                  \
    ((BL_Err_Type (*) (HBN_ACOMP_INT_EDGE_Type edge))ROM_APITABLE[ROM_API_INDEX_HBN_Disable_AComp1_IRQ])

#define RomDriver_HBN_Enable_BOR_IRQ                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Enable_BOR_IRQ])

#define RomDriver_HBN_Disable_BOR_IRQ                     \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Disable_BOR_IRQ])

#define RomDriver_HBN_Get_Reset_Event                     \
    ((BL_Sts_Type (*) (HBN_RST_EVENT_Type event))ROM_APITABLE[ROM_API_INDEX_HBN_Get_Reset_Event])

#define RomDriver_HBN_Clear_Reset_Event                   \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Clear_Reset_Event])

#define RomDriver_HBN_GPIO_Dbg_Pull_Cfg                   \
    ((BL_Err_Type (*) (BL_Fun_Type pupdEn, BL_Fun_Type dlyEn, uint8_t dlySec, HBN_INT_Type gpioIrq, BL_Mask_Type gpioMask))ROM_APITABLE[ROM_API_INDEX_HBN_GPIO_Dbg_Pull_Cfg])

#define RomDriver_HBN_Set_BOR_Cfg                         \
    ((BL_Err_Type (*) (HBN_BOR_CFG_Type *cfg))ROM_APITABLE[ROM_API_INDEX_HBN_Set_BOR_Cfg])

#define RomDriver_L1C_Cache_Write_Set                     \
    ((void (*) (BL_Fun_Type wtEn, BL_Fun_Type wbEn, BL_Fun_Type waEn))ROM_APITABLE[ROM_API_INDEX_L1C_Cache_Write_Set])

#define RomDriver_L1C_Cache_Enable_Set                    \
    ((BL_Err_Type (*) (uint8_t wayDisable))ROM_APITABLE[ROM_API_INDEX_L1C_Cache_Enable_Set])

#define RomDriver_L1C_Cache_Flush                         \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_Cache_Flush])

#define RomDriver_L1C_Cache_Hit_Count_Get                 \
    ((void (*) (uint32_t *hitCountLow, uint32_t *hitCountHigh))ROM_APITABLE[ROM_API_INDEX_L1C_Cache_Hit_Count_Get])

#define RomDriver_L1C_Cache_Miss_Count_Get                \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_Cache_Miss_Count_Get])

#define RomDriver_L1C_Cache_Read_Disable                  \
    ((void (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_Cache_Read_Disable])

#define RomDriver_L1C_Set_Wrap                            \
    ((BL_Err_Type (*) (BL_Fun_Type wrap))ROM_APITABLE[ROM_API_INDEX_L1C_Set_Wrap])

#define RomDriver_L1C_Set_Way_Disable                     \
    ((BL_Err_Type (*) (uint8_t disableVal))ROM_APITABLE[ROM_API_INDEX_L1C_Set_Way_Disable])

#define RomDriver_L1C_IROM_2T_Access_Set                  \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_L1C_IROM_2T_Access_Set])

#define RomDriver_L1C_BMX_Init                            \
    ((BL_Err_Type (*) (L1C_BMX_Cfg_Type *l1cBmxCfg))ROM_APITABLE[ROM_API_INDEX_L1C_BMX_Init])

#define RomDriver_L1C_BMX_Addr_Monitor_Enable             \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_BMX_Addr_Monitor_Enable])

#define RomDriver_L1C_BMX_Addr_Monitor_Disable            \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_BMX_Addr_Monitor_Disable])

#define RomDriver_L1C_BMX_BusErrResponse_Enable           \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_BMX_BusErrResponse_Enable])

#define RomDriver_L1C_BMX_BusErrResponse_Disable          \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_BMX_BusErrResponse_Disable])

