bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_romdriver.h
#define RomDriver_L1C_BMX_Get_Status                      \
    ((BL_Sts_Type (*) (L1C_BMX_BUS_ERR_Type errType))ROM_APITABLE[ROM_API_INDEX_L1C_BMX_Get_Status])

#define RomDriver_L1C_BMX_Get_Err_Addr                    \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_BMX_Get_Err_Addr])

#define RomDriver_PDS_Set_GPIO_Pad_Cfg                    \
    ((BL_Err_Type (*) (PDS_GPIO_Type pin, PDS_GPIO_Cfg_Type *cfg))ROM_APITABLE[ROM_API_INDEX_PDS_Set_GPIO_Pad_Cfg])

#define RomDriver_PDS_GPIO_Write                          \
    ((BL_Err_Type (*) (PDS_GPIO_GROUP_SET_Type grp, uint32_t val))ROM_APITABLE[ROM_API_INDEX_PDS_GPIO_Write])

#define RomDriver_PDS_Set_GPIO_Pad_IntMask                \
    ((BL_Err_Type (*) (PDS_GPIO_GROUP_SET_Type grp, BL_Mask_Type intMask))ROM_APITABLE[ROM_API_INDEX_PDS_Set_GPIO_Pad_IntMask])

#define RomDriver_PDS_Set_GPIO_Pad_IntMode                \
    ((BL_Err_Type (*) (PDS_GPIO_GROUP_SET_Type grp, PDS_GPIO_INT_TRIG_Type trig))ROM_APITABLE[ROM_API_INDEX_PDS_Set_GPIO_Pad_IntMode])

#define RomDriver_PDS_Set_GPIO_Pad_IntClr                 \
    ((BL_Err_Type (*) (PDS_GPIO_GROUP_SET_Type grp))ROM_APITABLE[ROM_API_INDEX_PDS_Set_GPIO_Pad_IntClr])

#define RomDriver_PDS_Set_All_GPIO_IntClear               \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Set_All_GPIO_IntClear])

#define RomDriver_PDS_Get_GPIO_Pad_IntStatus              \
    ((BL_Sts_Type (*) (PDS_GPIO_Type pin))ROM_APITABLE[ROM_API_INDEX_PDS_Get_GPIO_Pad_IntStatus])

#define RomDriver_PDS_Disable_GPIO_Keep                   \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Disable_GPIO_Keep])

#define RomDriver_PDS_Enable                              \
    ((BL_Err_Type (*) (PDS_CTL_Type *cfg, PDS_CTL4_Type *cfg4, uint32_t pdsSleepCnt))ROM_APITABLE[ROM_API_INDEX_PDS_Enable])

#define RomDriver_PDS_Force_Config                        \
    ((BL_Err_Type (*) (PDS_CTL2_Type *cfg2, PDS_CTL3_Type *cfg3))ROM_APITABLE[ROM_API_INDEX_PDS_Force_Config])

#define RomDriver_PDS_RAM_Config                          \
    ((BL_Err_Type (*) (PDS_RAM_CFG_Type *ramCfg))ROM_APITABLE[ROM_API_INDEX_PDS_RAM_Config])

#define RomDriver_PDS_Default_Level_Config                \
    ((BL_Err_Type (*) (PDS_DEFAULT_LV_CFG_Type *defaultLvCfg, uint32_t pdsSleepCnt))ROM_APITABLE[ROM_API_INDEX_PDS_Default_Level_Config])

#define RomDriver_PDS_Wakeup_Src_En                       \
    ((BL_Err_Type (*) (PDS_WAKEUP_SRC_Type intType, BL_Fun_Type enable))ROM_APITABLE[ROM_API_INDEX_PDS_Wakeup_Src_En])

#define RomDriver_PDS_Get_Wakeup_Src                      \
    ((BL_Sts_Type (*) (PDS_WAKEUP_SRC_Type intType))ROM_APITABLE[ROM_API_INDEX_PDS_Get_Wakeup_Src])

#define RomDriver_PDS_IntMask                             \
    ((BL_Err_Type (*) (PDS_INT_Type intType, BL_Mask_Type intMask))ROM_APITABLE[ROM_API_INDEX_PDS_IntMask])

#define RomDriver_PDS_Get_IntStatus                       \
    ((BL_Sts_Type (*) (PDS_INT_Type intType))ROM_APITABLE[ROM_API_INDEX_PDS_Get_IntStatus])

#define RomDriver_PDS_IntClear                            \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_IntClear])

#define RomDriver_PDS_Get_PdsRfStstus                     \
    ((PDS_RF_STS_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Get_PdsRfStstus])

#define RomDriver_PDS_Get_PdsStstus                       \
    ((PDS_STS_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Get_PdsStstus])

#define RomDriver_PDS_Clear_Reset_Event                   \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Clear_Reset_Event])

#define RomDriver_PDS_Get_Reset_Event                     \
    ((BL_Sts_Type (*) (PDS_RST_EVENT_Type event))ROM_APITABLE[ROM_API_INDEX_PDS_Get_Reset_Event])

#define RomDriver_PDS_Auto_Enable                         \
    ((void (*) (PDS_AUTO_POWER_DOWN_CFG_Type *powerCfg, PDS_AUTO_NORMAL_CFG_Type *normalCfg, BL_Fun_Type enable))ROM_APITABLE[ROM_API_INDEX_PDS_Auto_Enable])

#define RomDriver_PDS_Manual_Force_Turn_Off               \
    ((void (*) (PDS_FORCE_Type domain))ROM_APITABLE[ROM_API_INDEX_PDS_Manual_Force_Turn_Off])

#define RomDriver_PDS_Manual_Force_Turn_On                \
    ((void (*) (PDS_FORCE_Type domain))ROM_APITABLE[ROM_API_INDEX_PDS_Manual_Force_Turn_On])

#define RomDriver_PDS_Set_KYD_Matrix_Size                 \
    ((BL_Err_Type (*) (uint8_t col_size, uint8_t row_size))ROM_APITABLE[ROM_API_INDEX_PDS_Set_KYD_Matrix_Size])

#define RomDriver_PDS_Set_KYD_Col_Value                   \
    ((BL_Err_Type (*) (uint8_t val))ROM_APITABLE[ROM_API_INDEX_PDS_Set_KYD_Col_Value])

#define RomDriver_PDS_Set_KYD_Row_Pull                    \
    ((BL_Err_Type (*) (uint8_t en))ROM_APITABLE[ROM_API_INDEX_PDS_Set_KYD_Row_Pull])

#define RomDriver_PDS_Set_KYD_Wakeup_En                   \
    ((BL_Err_Type (*) (uint8_t en))ROM_APITABLE[ROM_API_INDEX_PDS_Set_KYD_Wakeup_En])

#define RomDriver_SF_Cfg_Init_Internal_Flash_Gpio         \
    ((void (*) (void))ROM_APITABLE[ROM_API_INDEX_SF_Cfg_Init_Internal_Flash_Gpio])

#define RomDriver_SF_Cfg_Init_Ext_Flash_Gpio              \
    ((int (*) (uint8_t extFlashPin))ROM_APITABLE[ROM_API_INDEX_SF_Cfg_Init_Ext_Flash_Gpio])

#define RomDriver_SF_Cfg_Deinit_Ext_Flash_Gpio            \
    ((int (*) (uint8_t extFlashPin))ROM_APITABLE[ROM_API_INDEX_SF_Cfg_Deinit_Ext_Flash_Gpio])

#define RomDriver_SF_Cfg_Get_Flash_Cfg_Need_Lock          \
    ((BL_Err_Type (*) (uint32_t flashID, spi_flash_cfg_type *pFlashCfg))ROM_APITABLE[ROM_API_INDEX_SF_Cfg_Get_Flash_Cfg_Need_Lock])

#define RomDriver_SF_Cfg_Init_Flash_Gpio                  \
    ((int (*) (uint8_t flashPinCfg, uint8_t restoreDefault))ROM_APITABLE[ROM_API_INDEX_SF_Cfg_Init_Flash_Gpio])

#define RomDriver_SF_Cfg_Flash_Identify                   \
    ((uint32_t (*) (uint8_t callFromFlash, uint32_t autoScan, uint32_t flashPinCfg, uint8_t restoreDefault, spi_flash_cfg_type *pFlashCfg))ROM_APITABLE[ROM_API_INDEX_SF_Cfg_Flash_Identify])

#define RomDriver_SF_Ctrl_Enable                          \
    ((void (*) (const struct sf_ctrl_cfg_type *cfg))ROM_APITABLE[ROM_API_INDEX_SF_Ctrl_Enable])

