bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_romdriver.h
#define RomDriver_IR_TxSWM                                \
    ((BL_Err_Type (*) (BL_Fun_Type txSWM))ROM_APITABLE[ROM_API_INDEX_IR_TxSWM])

#define RomDriver_IR_TxFifoClear                          \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_IR_TxFifoClear])

#define RomDriver_IR_SendData                             \
    ((BL_Err_Type (*) (uint32_t *data, uint8_t length))ROM_APITABLE[ROM_API_INDEX_IR_SendData])

#define RomDriver_IR_SWMSendData                          \
    ((BL_Err_Type (*) (uint16_t *data, uint8_t length))ROM_APITABLE[ROM_API_INDEX_IR_SWMSendData])

#define RomDriver_IR_SendCommand                          \
    ((BL_Err_Type (*) (uint32_t *data, uint8_t length))ROM_APITABLE[ROM_API_INDEX_IR_SendCommand])

#define RomDriver_IR_SWMSendCommand                       \
    ((BL_Err_Type (*) (uint16_t *data, uint8_t length))ROM_APITABLE[ROM_API_INDEX_IR_SWMSendCommand])

#define RomDriver_IR_SendNEC                              \
    ((BL_Err_Type (*) (uint8_t address, uint8_t command))ROM_APITABLE[ROM_API_INDEX_IR_SendNEC])

#define RomDriver_IR_IntMask                              \
    ((BL_Err_Type (*) (IR_INT_Type intType, BL_Mask_Type intMask))ROM_APITABLE[ROM_API_INDEX_IR_IntMask])

#define RomDriver_IR_ClrIntStatus                         \
    ((BL_Err_Type (*) (IR_INT_Type intType))ROM_APITABLE[ROM_API_INDEX_IR_ClrIntStatus])

#define RomDriver_IR_GetIntStatus                         \
    ((BL_Sts_Type (*) (IR_INT_Type intType))ROM_APITABLE[ROM_API_INDEX_IR_GetIntStatus])

#define RomDriver_IR_GetFifoStatus                        \
    ((BL_Sts_Type (*) (IR_FifoStatus_Type fifoSts))ROM_APITABLE[ROM_API_INDEX_IR_GetFifoStatus])

#define RomDriver_IR_GetTxFifoCount                       \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_IR_GetTxFifoCount])

#define RomDriver_IR_LEDInit                              \
    ((BL_Err_Type (*) (uint8_t clk, uint8_t div, uint8_t unit, uint8_t code0H, uint8_t code0L, uint8_t code1H, uint8_t code1L))ROM_APITABLE[ROM_API_INDEX_IR_LEDInit])

#define RomDriver_IR_LEDSend                              \
    ((BL_Err_Type (*) (uint32_t data))ROM_APITABLE[ROM_API_INDEX_IR_LEDSend])

#define RomDriver_KYS_Init                                \
    ((BL_Err_Type (*) (KYS_CFG_Type *kysCfg))ROM_APITABLE[ROM_API_INDEX_KYS_Init])

#define RomDriver_KYS_Enable                              \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_KYS_Enable])

#define RomDriver_KYS_Disable                             \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_KYS_Disable])

#define RomDriver_KYS_IntMask                             \
    ((BL_Err_Type (*) (KYS_INT_Type intType, BL_Mask_Type intMask))ROM_APITABLE[ROM_API_INDEX_KYS_IntMask])

#define RomDriver_KYS_IntClear                            \
    ((BL_Err_Type (*) (KYS_INT_CLR_Type intType))ROM_APITABLE[ROM_API_INDEX_KYS_IntClear])

#define RomDriver_KYS_GetIntStatus                        \
    ((BL_Sts_Type (*) (KYS_INT_Type intType))ROM_APITABLE[ROM_API_INDEX_KYS_GetIntStatus])

#define RomDriver_KYS_Get_FIFO_Idx                        \
    ((void (*) (uint8_t *fifo_head, uint8_t *fifo_tail))ROM_APITABLE[ROM_API_INDEX_KYS_Get_FIFO_Idx])

#define RomDriver_KYS_ReadKeyfifo                         \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_KYS_ReadKeyfifo])

#define RomDriver_Psram_Init                              \
    ((void (*) (SPI_Psram_Cfg_Type *psramCfg, struct sf_ctrl_cmds_cfg *cmdsCfg, struct sf_ctrl_psram_cfg *sfCtrlPsramCfg))ROM_APITABLE[ROM_API_INDEX_Psram_Init])

#define RomDriver_Psram_ReadReg                           \
    ((void (*) (SPI_Psram_Cfg_Type *psramCfg, uint8_t *regValue))ROM_APITABLE[ROM_API_INDEX_Psram_ReadReg])

#define RomDriver_Psram_WriteReg                          \
    ((void (*) (SPI_Psram_Cfg_Type *psramCfg, uint8_t *regValue))ROM_APITABLE[ROM_API_INDEX_Psram_WriteReg])

#define RomDriver_Psram_SetDriveStrength                  \
    ((BL_Err_Type (*) (SPI_Psram_Cfg_Type *psramCfg))ROM_APITABLE[ROM_API_INDEX_Psram_SetDriveStrength])

#define RomDriver_Psram_SetBurstWrap                      \
    ((BL_Err_Type (*) (SPI_Psram_Cfg_Type *psramCfg))ROM_APITABLE[ROM_API_INDEX_Psram_SetBurstWrap])

#define RomDriver_Psram_ReadId                            \
    ((void (*) (SPI_Psram_Cfg_Type *psramCfg, uint8_t *data))ROM_APITABLE[ROM_API_INDEX_Psram_ReadId])

#define RomDriver_Psram_EnterQuadMode                     \
    ((BL_Err_Type (*) (SPI_Psram_Cfg_Type *psramCfg))ROM_APITABLE[ROM_API_INDEX_Psram_EnterQuadMode])

#define RomDriver_Psram_ExitQuadMode                      \
    ((BL_Err_Type (*) (SPI_Psram_Cfg_Type *psramCfg))ROM_APITABLE[ROM_API_INDEX_Psram_ExitQuadMode])

#define RomDriver_Psram_ToggleBurstLength                 \
    ((BL_Err_Type (*) (SPI_Psram_Cfg_Type *psramCfg, PSRAM_Ctrl_Mode ctrlMode))ROM_APITABLE[ROM_API_INDEX_Psram_ToggleBurstLength])

#define RomDriver_Psram_SoftwareReset                     \
    ((BL_Err_Type (*) (SPI_Psram_Cfg_Type *psramCfg, PSRAM_Ctrl_Mode ctrlMode))ROM_APITABLE[ROM_API_INDEX_Psram_SoftwareReset])

#define RomDriver_Psram_Set_IDbus_Cfg                     \
    ((BL_Err_Type (*) (SPI_Psram_Cfg_Type *psramCfg, uint8_t ioMode, uint32_t addr, uint32_t len))ROM_APITABLE[ROM_API_INDEX_Psram_Set_IDbus_Cfg])

#define RomDriver_Psram_Cache_Write_Set                   \
    ((BL_Err_Type (*) (SPI_Psram_Cfg_Type *psramCfg, uint8_t ioMode, BL_Fun_Type wtEn, BL_Fun_Type wbEn, BL_Fun_Type waEn))ROM_APITABLE[ROM_API_INDEX_Psram_Cache_Write_Set])

#define RomDriver_Psram_Write                             \
    ((BL_Err_Type (*) (SPI_Psram_Cfg_Type *psramCfg, uint8_t ioMode, uint32_t addr, uint8_t *data, uint32_t len))ROM_APITABLE[ROM_API_INDEX_Psram_Write])

#define RomDriver_Psram_Read                              \
    ((BL_Err_Type (*) (SPI_Psram_Cfg_Type *psramCfg, uint8_t ioMode, uint32_t addr, uint8_t *data, uint32_t len))ROM_APITABLE[ROM_API_INDEX_Psram_Read])

#define RomDriver_TIMER_GetCompValue                      \
    ((uint32_t (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo))ROM_APITABLE[ROM_API_INDEX_TIMER_GetCompValue])

