bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_romdriver.h
#define RomDriver_TIMER_SetCompValue                      \
    ((void (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo, uint32_t val))ROM_APITABLE[ROM_API_INDEX_TIMER_SetCompValue])

#define RomDriver_TIMER_CompValueEffectImmediately        \
    ((void (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, BL_Fun_Type enable))ROM_APITABLE[ROM_API_INDEX_TIMER_CompValueEffectImmediately])

#define RomDriver_TIMER_GetCounterValue                   \
    ((uint32_t (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh))ROM_APITABLE[ROM_API_INDEX_TIMER_GetCounterValue])

#define RomDriver_TIMER_ResetCounterValue                 \
    ((void (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh))ROM_APITABLE[ROM_API_INDEX_TIMER_ResetCounterValue])

#define RomDriver_TIMER_GetMatchStatus                    \
    ((BL_Sts_Type (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo))ROM_APITABLE[ROM_API_INDEX_TIMER_GetMatchStatus])

#define RomDriver_TIMER_GetPreloadValue                   \
    ((uint32_t (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh))ROM_APITABLE[ROM_API_INDEX_TIMER_GetPreloadValue])

#define RomDriver_TIMER_SetPreloadValue                   \
    ((void (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, uint32_t val))ROM_APITABLE[ROM_API_INDEX_TIMER_SetPreloadValue])

#define RomDriver_TIMER_SetPreloadTrigSrc                 \
    ((void (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_PreLoad_Trig_Type plSrc))ROM_APITABLE[ROM_API_INDEX_TIMER_SetPreloadTrigSrc])

#define RomDriver_TIMER_SetCountMode                      \
    ((void (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_CountMode_Type countMode))ROM_APITABLE[ROM_API_INDEX_TIMER_SetCountMode])

#define RomDriver_TIMER_ClearIntStatus                    \
    ((void (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo))ROM_APITABLE[ROM_API_INDEX_TIMER_ClearIntStatus])

#define RomDriver_TIMER_Init                              \
    ((BL_Err_Type (*) (TIMER_ID_Type timerId, TIMER_CFG_Type *timerCfg))ROM_APITABLE[ROM_API_INDEX_TIMER_Init])

#define RomDriver_TIMER_DeInit                            \
    ((BL_Err_Type (*) (TIMER_ID_Type timerId))ROM_APITABLE[ROM_API_INDEX_TIMER_DeInit])

#define RomDriver_TIMER_Enable                            \
    ((void (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh))ROM_APITABLE[ROM_API_INDEX_TIMER_Enable])

#define RomDriver_TIMER_Disable                           \
    ((void (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh))ROM_APITABLE[ROM_API_INDEX_TIMER_Disable])

#define RomDriver_TIMER_IntMask                           \
    ((void (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_INT_Type intType, BL_Mask_Type intMask))ROM_APITABLE[ROM_API_INDEX_TIMER_IntMask])

#define RomDriver_TIMER_GPIOSetPolarity                   \
    ((void (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_GPIO_Polarity_Type polarity))ROM_APITABLE[ROM_API_INDEX_TIMER_GPIOSetPolarity])

#define RomDriver_TIMER_CH0_SetMeasurePulseWidth          \
    ((void (*) (TIMER_ID_Type timerId, BL_Fun_Type enable))ROM_APITABLE[ROM_API_INDEX_TIMER_CH0_SetMeasurePulseWidth])

#define RomDriver_TIMER_CH0_GetMeasurePulseWidth          \
    ((uint32_t (*) (TIMER_ID_Type timerId))ROM_APITABLE[ROM_API_INDEX_TIMER_CH0_GetMeasurePulseWidth])

#define RomDriver_TIMER_ForceClockDivision                \
    ((void (*) (TIMER_ID_Type timerId, TIMER_Chan_Type timerCh))ROM_APITABLE[ROM_API_INDEX_TIMER_ForceClockDivision])

#define RomDriver_WDT_Set_Clock                           \
    ((void (*) (WDT_ID_Type wdtId, TIMER_ClkSrc_Type clkSrc, uint8_t div))ROM_APITABLE[ROM_API_INDEX_WDT_Set_Clock])

#define RomDriver_WDT_GetMatchValue                       \
    ((uint16_t (*) (WDT_ID_Type wdtId))ROM_APITABLE[ROM_API_INDEX_WDT_GetMatchValue])

#define RomDriver_WDT_SetCompValue                        \
    ((void (*) (WDT_ID_Type wdtId, uint16_t val))ROM_APITABLE[ROM_API_INDEX_WDT_SetCompValue])

#define RomDriver_WDT_CompValueEffectImmediately          \
    ((void (*) (WDT_ID_Type wdtId, BL_Fun_Type enable))ROM_APITABLE[ROM_API_INDEX_WDT_CompValueEffectImmediately])

#define RomDriver_WDT_GetCounterValue                     \
    ((uint16_t (*) (WDT_ID_Type wdtId))ROM_APITABLE[ROM_API_INDEX_WDT_GetCounterValue])

#define RomDriver_WDT_ResetCounterValue                   \
    ((void (*) (WDT_ID_Type wdtId))ROM_APITABLE[ROM_API_INDEX_WDT_ResetCounterValue])

#define RomDriver_WDT_GetResetStatus                      \
    ((BL_Sts_Type (*) (WDT_ID_Type wdtId))ROM_APITABLE[ROM_API_INDEX_WDT_GetResetStatus])

#define RomDriver_WDT_ClearResetStatus                    \
    ((void (*) (WDT_ID_Type wdtId))ROM_APITABLE[ROM_API_INDEX_WDT_ClearResetStatus])

#define RomDriver_WDT_Enable                              \
    ((void (*) (WDT_ID_Type wdtId))ROM_APITABLE[ROM_API_INDEX_WDT_Enable])

#define RomDriver_WDT_Disable                             \
    ((void (*) (WDT_ID_Type wdtId))ROM_APITABLE[ROM_API_INDEX_WDT_Disable])

#define RomDriver_WDT_ForceClockDivision                  \
    ((void (*) (WDT_ID_Type wdtId))ROM_APITABLE[ROM_API_INDEX_WDT_ForceClockDivision])

#define RomDriver_WDT_IntMask                             \
    ((void (*) (WDT_ID_Type wdtId, WDT_INT_Type intType, BL_Mask_Type intMask))ROM_APITABLE[ROM_API_INDEX_WDT_IntMask])

#define RomDriver_WDT_GPIOSetPolarity                     \
    ((void (*) (WDT_ID_Type wdtId, TIMER_GPIO_Polarity_Type polarity))ROM_APITABLE[ROM_API_INDEX_WDT_GPIOSetPolarity])

#define RomDriver_arch_memcpy                             \
    ((void * (*) (void *dst, const void *src, uint32_t n))ROM_APITABLE[ROM_API_INDEX_arch_memcpy])

#define RomDriver_arch_memcpy4                            \
    ((uint32_t * (*) (uint32_t *dst, const uint32_t *src, uint32_t n))ROM_APITABLE[ROM_API_INDEX_arch_memcpy4])

#define RomDriver_arch_memcpy_fast                        \
    ((void * (*) (void *pdst, const void *psrc, uint32_t n))ROM_APITABLE[ROM_API_INDEX_arch_memcpy_fast])

#define RomDriver_arch_memset                             \
    ((void * (*) (void *s, uint8_t c, uint32_t n))ROM_APITABLE[ROM_API_INDEX_arch_memset])

#define RomDriver_arch_memset4                            \
    ((uint32_t * (*) (uint32_t *dst, const uint32_t val, uint32_t n))ROM_APITABLE[ROM_API_INDEX_arch_memset4])

#define RomDriver_arch_memcmp                             \
    ((int (*) (const void *s1, const void *s2, uint32_t n))ROM_APITABLE[ROM_API_INDEX_arch_memcmp])

#define RomDriver_memcopy_to_fifo                         \
    ((void (*) (void *fifo_addr, uint8_t *data, uint32_t length))ROM_APITABLE[ROM_API_INDEX_memcopy_to_fifo])

#define RomDriver_fifocopy_to_mem                         \
    ((void (*) (void *fifo_addr, uint8_t *data, uint32_t length))ROM_APITABLE[ROM_API_INDEX_fifocopy_to_mem])

#define RomDriver_BFLB_Soft_CRC32_Ex                      \
    ((uint32_t (*) (uint32_t initial, void *dataIn, uint32_t len))ROM_APITABLE[ROM_API_INDEX_BFLB_Soft_CRC32_Ex])

#define RomDriver_BFLB_Soft_CRC32                         \
    ((uint32_t (*) (void *dataIn, uint32_t len))ROM_APITABLE[ROM_API_INDEX_BFLB_Soft_CRC32])

/*@} end of group ROMDRIVER_Public_Macros */

/** @defgroup  ROMDRIVER_Public_Functions
 *  @{
 */

/*@} end of group ROMDRIVER_Public_Functions */

/*@} end of group ROMDRIVER */

/*@} end of group BL702L_Peripheral_Driver */

#ifdef __cplusplus
}
#endif

#endif /* __BL702L_ROMDRIVER_H__ */
